<?php

declare(strict_types=1);

###############################################################################################################
###############################################################################################################
##                                                                                                           ##
##  ######################     #####            #####     #####            #####     ######################  ##
##  ######################     #####            #####     #####            #####     ######################  ##
##  ######################     ######           #####     #####            #####     ######################  ##
##  ######################     #######          #####     #####            #####     ######################  ##
##  ######################     ########         #####     #####            #####     ######################  ##
##  #####            #####     #########        #####     #####            #####     #####                   ##
##  #####            #####     ##########       #####     #####            #####     #####     .COM.BR       ##
##  #####            #####     ##### #####      #####     ######################     ######################  ##
##  #####            #####     #####  #####     #####     ######################     ######################  ##
##  ######################     #####   #####    #####     ######################     ######################  ##
##  ######################     #####    #####   #####     ######################     ######################  ##
##  ######################     #####     #####  #####     ######################     ######################  ##
##  ######################     #####      ##### #####     #####            #####                      #####  ##
##  ######################     #####       ##########     #####            #####                      #####  ##
##  #####                      #####        #########     #####            #####     ######################  ##
##  #####                      #####         ########     #####            #####     ######################  ##
##  #####                      #####          #######     #####            #####     ######################  ##
##  #####                      #####           ######     #####            #####     ######################  ##
##  #####                      #####            #####     #####            #####     ######################  ##
##                                                                                                           ##
###############################################################################################################
##                   TODOS OS DIREITOS RESERVADOS  O SENHOR E MEU PASTOR E NADA ME FALTARÁ                   ##
###############################################################################################################
###############################################################################################################
###############################################################################################################
##                                          INICIO CÓDIGO DE FONTE!                                          ##
###############################################################################################################

namespace Pnhs\ParserNF\layout;

use stdClass;

class f extends layout
{
  public static function run(object $data): stdClass
  {
    $parser = $data->NFe->infNFe->retirada;
    $std = new stdClass;

    if (!$parser)
      return $std;

    $std->CNPJ    = self::tag((string) $parser->CNPJ, 'CNPJ não informado', 'F02', 0);
    $std->CPF     = self::tag((string) $parser->CPF, 'CPF não informado', 'F02a', 0);
    if (!($parser->CNPJ || $parser->CPF)) self::tag((string) $parser->CNPJ, 'CNPJ não informado', 'F02', 1);
    $std->xNome   = self::tag((string) $parser->xNome, 'xNome não informado', 'F02b', 0);
    $std->xLgr    = self::tag((string) $parser->xLgr, 'xLgr não informado', 'F03', 1);
    $std->nro     = self::tag((string) $parser->nro, 'nro não informado', 'F04', 1);
    $std->xCpl    = self::tag((string) $parser->xCpl, 'xCpl não informado', 'F05', 0);
    $std->xBairro = self::tag((string) $parser->xBairro, 'xBairro não informado', 'F06', 1);
    $std->cMun    = self::tag((string) $parser->cMun, 'cMun não informado', 'F07', 1);
    $std->xMun    = self::tag((string) $parser->xMun, 'xMun não informado', 'F08', 1);
    $std->UF      = self::tag((string) $parser->UF, 'UF não informado', 'F09', 1);
    $std->CEP     = self::tag((string) $parser->CEP, 'CEP não informado', 'F10', 0);
    $std->cPais   = self::tag((string) $parser->cPais, 'cPais não informado', 'F11', 0);
    $std->xPais   = self::tag((string) $parser->xPais, 'xPais não informado', 'F12', 0);
    $std->fone    = self::tag((string) $parser->fone, 'fone não informado', 'F13', 0);
    $std->email   = self::tag((string) $parser->email, 'email não informado', 'F14', 0);
    $std->IE      = self::tag((string) $parser->IE, 'CNPJ não informado', 'F15', 0);

    return $std;
  }
}
